<template>
  <div>
    <van-collapse v-model="activeName" @change="onChange" accordion>
      <van-collapse-item title="可回收垃圾" name="1">
        <p>可回收物主要包括废纸、塑料、玻璃、金属和布料五大类</p>
        <ul>
          <li>
            废纸:主要包括报纸、期刊、图书、各种包装纸等。但是，要注意纸巾和厕所纸由于水溶性太强不可回收。
          </li>
          <li>
            塑料:各种塑料袋、塑料泡沫、塑料包装(快递包装纸是其他垃圾/干垃圾)、一次性塑料餐盒餐具、硬塑料、塑料牙刷、塑料杯子、矿泉水瓶等。
          </li>
          <li>布料:主要包括废弃衣服、桌布、洗脸巾、书包、鞋等。</li>
          <li>
            废纸:主要包括报纸、期刊、图书、各种包装纸等。但是，要注意纸巾和厕所纸由于水溶性太强不可回收。
          </li>
        </ul>
      </van-collapse-item>
      <van-collapse-item title="有害垃圾" name="2">
        有害垃圾含有对人体健康有害的重金属、有毒的物质或者对环境造成现实危害或者潜在危害的废弃物。包括电池、荧光灯管、灯泡、水银温度计、油漆桶、部分家电、过期药品及其容器、过期化妆品等。这些垃圾一般使用单独回收或填埋处理。
      </van-collapse-item>
      <van-collapse-item title="厨余垃圾" name="3">
        厨余垃圾(上海称湿垃圾)包括剩菜剩饭、骨头、菜根菜叶、果皮等食品类废物。经生物技术就地处理堆肥，每吨可生产0.6~0.7吨有机肥料。
      </van-collapse-item>
      <van-collapse-item title="其他垃圾" name="4">
        其他垃圾(上海称干垃圾)包括除上述几类垃圾之外的砖瓦陶瓷、渣土、卫生间废纸、纸巾等难以回收的废弃物及尘土、食品袋(盒)。采取卫生填埋可有效减少对地下水、地表水、土壤及空气的污染。
        大棒骨因为"难腐蚀"被列入"其它垃圾"。玉米核、坚果壳、果核、鸡骨等则是餐厨垃圾。
        卫生纸:厕纸、卫生纸遇水即溶，不算可回收的"纸张"，类似的还有烟盒等。
        餐厨垃圾装袋:常用的塑料袋，即使是可以降解的也远比餐厨垃圾更难腐蚀。此外塑料袋本身是可回收垃圾。正确做法应该是将餐厨垃圾倒入垃圾桶，塑料袋另扔进"可回收垃圾"桶。
        果壳:在垃圾分类中，"果壳瓜皮"的标识就是花生壳，的确属于厨余垃圾。家里用剩的废弃食用油，也归类在"厨余垃圾"。
        尘土:在垃圾分类中，尘土属于"其它垃圾"，但残枝落叶属于"厨余垃圾"，包括家里开败的鲜花等。
      </van-collapse-item>
    </van-collapse>
  </div>
</template>

<script setup>
import { ref } from '@vue/reactivity'
let activeName = ref('1')
const onChange = (e) => {
  activeName.value = e
}
</script>

<style lang="scss" scoped></style>
